IdeaRS.OpenModel.Loading.ResultClass
ResultClass object

IdeaRS.OpenModel.Loading.ResultClass.#ctor
constructor

IdeaRS.OpenModel.Loading.ResultClass.Name
Name of ResultClass

IdeaRS.OpenModel.Loading.ResultClass.ListItem
List of objects in this library

IdeaRS.OpenModel.Loading.ResultClass.Description
Description of IResultClass

IdeaRS.OpenModel.Loading.ResultClass.TypeResultClass
TypeResultsClass

IdeaRS.OpenModel.Loading.ResultClass.IdConstructionStage
Id of IConstructionStage, 0 == IConstructionStage is not defined

IdeaRS.OpenModel.Loading.ResultClass.TypeUpdateResultClass
Type of update RC. If TypeUpdateResultClass is Update, ListItem will be updated

IdeaRS.OpenModel.Loading.ResultClass.Nonlinear
Class contains nonlinear combinations (loaded as loadcase)